Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: The client initiates a `fetch-pack` process that connects to an `upload-pack` process on the remote side to negotiate what data will be transferred down.
cs: Klient iniciuje proces `fetch-pack`, který vytvoří připojení k procesu `upload-pack` na straně vzdáleného serveru a dojedná, která data budou stažena.

source: The code looks like this:
cs: Kód má tuto podobu:

source: The command for this is simple: `git push [remote-name] [branch-name]`.(((git commands, push))) If you want to push your master branch to your `origin` server (again, cloning generally sets up both of those names for you automatically), then you can run this to push any commits you've done back up to the server:
cs: Příslušný příkaz je jednoduchý: `git push [jméno-vzdáleného-serveru] [jméno-větve]`.(((git příkazy, push))) Pokud chcete na server `origin` odeslat svou větev `master` (znovu připomeňme, že při klonování se vám obě tato jména nastaví automaticky), pak následující příkaz odešle na server všechny vaše revize (commits):

source: The command goes out to that remote project and pulls down all the data from that remote project that you don't have yet.
cs: Příkaz zamíří do vzdáleného projektu a stáhne z něj všechna data, která ještě nemáte u sebe.

source: The command helpfully tells you that if you're on the master branch and you run `git pull`, it will automatically merge in the master branch on the remote after it fetches all the remote references.
cs: Příkaz vám mimo jiné sděluje, že pokud se nacházíte na větvi `master` a spustíte příkaz `git pull`, pak se po vyzvednutí všech vzdálených referencí (fetch) větev `master` ze vzdáleného serveru automaticky začlení (merge).

source: The command is `filter-branch`, and it can rewrite huge swaths of your history, so you probably shouldn’t use it unless your project isn’t yet public and other people haven’t based work off the commits you’re about to rewrite.
cs: Příkaz pro tento případ je `filter-branch`. Dokáže přepsat velké části vaší historie, a proto byste ho určitě neměli používat, pokud už byl váš projekt zveřejněn a ostatní uživatelé už založili svou práci na revizích, které hodláte přepsat.

source: The command is a bit strange, but it works.
cs: Příkaz je sice trochu zvláštní, ale funguje.

source: The command to do this is `git archive`:
cs: Příkaz pro vytvoření archivu zní `git archive`:

source: The commit message by default looks something like this:
cs: Zpráva k revizi má v takovém případě přednastavenu tuto podobu:

source: The commit message must be expressed in a special format:
cs: Zpráva k revizi musí být ve speciálním formátu:

source: The cons of this method are that shared access is generally more difficult to set up and reach from multiple locations than basic network access.
cs: Nevýhodou této metody je, že nastavit a získat sdílený přístup z více umístění je většinou těžší než obyčejný síťový přístup.

source: The contributor pushes to their own public copy.
cs: Přispěvatel odešle změny do své vlastní veřejné kopie.

source: The contributor sends the maintainer an email asking them to pull changes.
cs: Přispěvatel pošle správci email, ve kterém jej požádá o vtažení změn (pull).

source: The default branch name in Git is `master`.
cs: Výchozím názvem větve v Gitu je `master` (hlavní větev).

source: The dictator merges the lieutenants' `master` branches into the dictator's `master` branch.
cs: Diktátor začleňuje větve `master` poručíků do své větve `master`.

source: The dictator pushes their `master` to the reference repository so the other developers can rebase on it.
cs: Diktátor odesílá svou větev `master` do referenčního repozitáře, aby ji ostatní vývojáři mohli použít jako základ pro přeskládání (rebase).

source: The diff wrapper checks to make sure seven arguments are provided and passes two of them to your merge script.
cs: Wrapper nástroje diff zkontroluje zda je skutečně zadáno sedm parametrů a předá dva z nich do skriptu pro slučování.

source: The difference becomes apparent when you specify a number.
cs: Rozdíl mezi nimi je patrný při zadání čísla.

source: The difference is how you submit them to the project.
cs: Liší se to, jak je budete doručovat do projektu.

source: The double-dot syntax is useful as a shorthand; but perhaps you want to specify more than two branches to indicate your revision, such as seeing what commits are in any of several branches that aren’t in the branch you’re currently on.
cs: Zápis s dvěma tečkami přestavuje užitečnou zkratku. Možná ale budete chtít k označení revize určit více než dvě větve, např. až budete chtít zjistit, které revize jsou obsaženy ve všech ostatních větvích a zároveň nejsou obsaženy ve větvi, na níž se právě nacházíte.

source: The downside of the Git protocol is the lack of authentication.
cs: Nevýhodou protokolu Git je, že neprovádí autentizaci.

source: The easiest is probably to install the Xcode Command Line Tools.(((Xcode))) On Mavericks (10.9) or above you can do this simply by trying to run 'git' from the Terminal the very first time.
cs: Nejjednodušší pravděpodobně bude, když nainstalujete nástroje příkazového řádku Xcode.(((Xcode))) U systému Mavericks (10.9) a vyšších můžete v okně Terminálu zkusit hned od začátku napsat `git`.

source: The easiest way is to specify `-a` when you run the `tag` command:(((git commands, tag)))
cs: Nejjednodušším způsobem je zadat k příkazu `tag` parametr `-a`:(((git příkazy, tag)))

source: The easiest way to integrate the branches, as we've already covered, is the `merge` command.
cs: Jak jsme si již ukázali, nejjednodušší způsob spojení větví spočívá v použití příkazu `merge`.

source: The editor displays the following text (this example is a Vim screen):
cs: Editor zobrazí následující text (tento příklad je z editoru Vim):

source: The end snapshot should be identical no matter which order she chooses; only the history will be slightly different.
cs: Konečný snímek bude stejný, ať zvolí jakékoli pořadí. Trochu se bude lišit jen historie revizí.

source: The examples in the previous section show `schacon` in some places, such as the `blame` output and the `git svn log`.
cs: V předchozí části se u některých příkladů (výstupy příkazů `blame` nebo `git svn log`) objevilo jméno `schacon`.

source: The file is meant to be consumed by a machine.
cs: Soubor je určen ke strojovému zpracování.

source: The files end up looking like this:
cs: Soubory nakonec vypadají takto:

source: The first developer, John, clones the repository, makes a change, and commits locally.
cs: První vývojář, John, naklonuje repozitář, provede změny a zapíše lokální revizi.

source: The first edition of this book is what got me hooked on Git.
cs: První vydání této knihy způsobilo, že jsem systému Git propadl.

source: The first edition was published over four years ago now.
cs: První vydání bylo publikováno před více než čtyřmi lety footnote:[Pozn. překl.: Originál i český překlad první edice vyšly v roce 2009. Druhé vydání originálu vyšlo v roce 2014.].

source: The first four hooks have to do with the committing process.
cs: První čtyři zásuvné moduly se týkají zapisování revizí.

source: The first hook that is run is `applypatch-msg`.
cs: První zásuvným modulem, který se spouští, je `applypatch-msg`.

source: The first is `git svn create-ignore`, which automatically creates corresponding `.gitignore` files for you so your next commit can include them.
cs: Tím prvním je `git svn create-ignore`, jenž automaticky vytvoří odpovídající soubory `.gitignore`, podle nichž se bude řídit už vaše příští revize.

source: The first is to set up accounts for everybody, which is straightforward but can be cumbersome.
cs: Prvním způsobem je nastavit účty pro všechny, což je sice přímočaré, ale může to být poněkud zdlouhavé.

source: The first line tells Git to ignore any files ending in ``.o'' or ``.a'' – object and archive files that may be the product of building your code.
cs: První řádek Gitu říká, že se mají ignorovat všechny soubory končící na `.o` nebo `.a` -- objekty a archivní soubory, které mohou být výsledkem překladu.

source: The first line was printed out by you, the other two were Git telling you that the update script exited non-zero and that is what is declining your push.
cs: První řádek jste vytvořili vy, dalšími dvěma řádky vám Git sděluje, že je výstup skriptu update nenulový, a proto bude odeslání odmítnuto.

source: The first parent is the branch you were on when you merged, and the second is the commit on the branch that you merged in:
cs: První rodič je větev, na níž jste se během začlenění nacházeli, druhým rodičem je větev, kterou jste začleňovali:

source: The first place Git looks for these values is in an `/etc/gitconfig` file, which contains values for every user on the system and all of their repositories.
cs: Prvním místem, kde Git tyto hodnoty vyhledává, je soubor `/etc/gitconfig`, obsahující hodnoty pro každého uživatele v systému a všechny jejich repozitáře.

source: The first problem is the author information.
cs: Prvním problémem jsou informace o autorovi.

source: The first script to run when handling a push from a client is `pre-receive`.
cs: Prvním skriptem, který se při manipulaci s revizemi přijatými od klienta spustí, je `pre-receive`.

source: The first section of this chapter will cover the available protocols and the pros and cons of each.
cs: První část této kapitoly se bude věnovat dostupným protokolům a kladům a záporům každého z nich.

source: The first takes an existing project or directory and imports it into Git.
cs: První způsob spočívá v tom, že vezmeme existující projekt nebo adresář a importujeme ho do Gitu.

source: The first thing this command does is pull down the `info/refs` file.
cs: První věcí, kterou příkaz udělá, je stažení souboru `info/refs`.

source: The first thing you should do when you install Git is to set your user name and email address.
cs: První věcí, kterou byste měli po nainstalování systému Git udělat, je nastavení vašeho uživatelského jména a e-mailové adresy.

source: The first variable is active contributor count – how many users are actively contributing code to this project, and how often?
cs: První proměnnou je počet aktivních přispěvatelů. Kolik uživatelů aktivně přispívá svým kódem do projektu a jak často?

source: The following command is equivalent:
cs: Následující příkaz je ekvivalentní:

source: The format consists of the word data, the size of the data to be read, a newline, and finally the data.
cs: Tento formát tedy obsahuje slovo data, velikost načítaných dat (size), nový řádek a konečně data samotná (contents).

source: The format for listing the new file contents or specifying a modified file with the new contents is as follows:
cs: Formát pro výpis obsahu nového souboru nebo určení změněného souboru s novým obsahem je následující:

source: The format of the refspec is an optional `+`, followed by `<src>:<dst>`, where `<src>` is the pattern for references on the remote side and `<dst>` is where those references will be written locally.
cs: Refspec má následující formát: fakultativní znak `+`, za nímž následuje `<src>:<dst>`, kde `<src>` je vzor pro referenci na straně vzdáleného serveru a `<dst>` je lokální umístění, kam mají být tyto reference zapsány.

source: The general sequence is something like this:
cs: Obvyklá posloupnost vypadá takto:

source: The hooks are all stored in the `hooks` subdirectory of the Git directory.
cs: Všechny zásuvné moduly jsou uloženy v podadresáři `hooks` adresáře Git.

source: The idea is that your branches are at various levels of stability; when they reach a more stable level, they're merged into the branch above them.
cs: Hlavní myšlenka je taková, že se větve nacházejí na různé úrovni stability. Jakmile dosáhnou stability o stupeň vyšší, jsou začleněny do větve nad nimi.

source: The idea of the subtree merge is that you have two projects, and one of the projects maps to a subdirectory of the other one and vice versa.
cs: Začlenění podstromu spočívá v tom, že máte dva projekty a jeden z projektů se promítá do podadresáře druhého projektu a naopak.

source: The index is a file that contains offsets into that packfile so you can quickly seek to a specific object.
cs: Index je soubor, který obsahuje ofsety do tohoto balíčkového souboru, díky nimž lze rychle vyhledat konkrétní objekt.

source: The installer includes a command line version of Git as well as the GUI.
cs: Instalátor v sobě zahrnuje jak verzi Gitu pro příkazový řádek, tak i grafické uživatelské rozhraní.

source: The interactive rebase gives you a script that it’s going to run.
cs: V interaktivním režimu přeskládání se nyní spustí skript.

source: The issue with including the library is that it’s difficult to customize the library in any way and often more difficult to deploy it, because you need to make sure every client has that library available.
cs: Problém s použitím knihovny je ten, že je obtížné knihovnu jakýmkoli způsobem upravit a často ještě těžší ji nasadit, protože se musíte ujistit, že ji má k dispozici každý klient.

source: The issue with vendoring the code into your own project is that any custom changes you make are difficult to merge when upstream changes become available.
cs: Problémem s převzetím zdrojového kódu do vlastního projektu bývá, že jakékoli uživatelské změny, které provedete, se obtížně začleňují, pokud se objeví novější změny.

source: The last major range-selection syntax is the triple-dot syntax, which specifies all the commits that are reachable by either of two references but not by both of them.
cs: Poslední významnou syntaxí k určení intervalu je trojtečková syntaxe, která vybere všechny revize dostupné ve dvou referencích, ale ne v obou zároveň.

source: The last piece of meta-information you need for each commit is the committer data, which you hardcode in a global variable:
cs: Posledními metadaty, jež budete pro všechny revize potřebovat, jsou informace o autorovi revize, které zadáte v globální proměnné:

source: The last really useful option to pass to `git log` as a filter is a path.
cs: Poslední opravdu užitečná volba pro `git log` spočívá ve filtrování podle zadané cesty.

source: The last thing to do is add your new Git server as a remote and push to it.
cs: Poslední věcí, která ještě zbývá, je přidat nový server Git jako vzdálený repozitář a odeslat do něj revize.

source: The last thing to keep in mind is the commit message.
cs: Poslední věcí, na kterou byste měli myslet, jsou zprávy k revizím.

source: The last thing you need to do is to return the current mark so it can be passed to the next iteration:
cs: Poslední věcí, kterou musíte udělat, je vrátit aktuální označovač, aby mohl být zadán do příští iterace:

source: The latter wouldn't be ideal, because all your code repository instances would reside on the same computer, making a catastrophic loss much more likely.
cs: Druhá varianta není právě ideální, protože všechny instance repozitáře s kódem jsou umístěny na stejném počítači, čímž se zvyšuje riziko katastrofické ztráty dat.

source: The main reason to specify the `file://` prefix is if you want a clean copy of the repository with extraneous references or objects left out – generally after an import from another version-control system or something similar (see <<_git_internals>> for maintenance tasks).
cs: Hlavním důvodem, proč zadat předponu `file://` je to, že tak získáte čistou kopii repozitáře bez nepotřebných referencí a objektů, například po importu z jiného verzovacího systému a podobně (viz popis úkonů správy v kapitole <<_git_internals>>).

source: The main tool you use to determine which files are in which state is the `git status` command.(((git commands, status))) If you run this command directly after a clone, you should see something like this:
cs: Hlavním nástrojem na zjišťování stavu jednotlivých souborů je příkaz `git status`.(((git commands, status))) Spustíte-li tento příkaz bezprostředně po klonování, objeví se zhruba následující:

source: The maintainer adds the contributor's repo as a remote and merges locally.
cs: Správce si přidá přispěvatelův repozitář jako vzdálený a provede lokální sloučení (merge).

source: The maintainer can then add your repository as a remote, test your changes locally, merge them into their branch, and push back to their repository.
cs: Správce si pak může váš repozitář přidat jako vzdálený, lokálně otestovat vaše změny, začlenit (merge) je do své větve a odeslat zpět (push) do svého repozitáře.

source: The maintainer of the Git project has solved this issue by including their public key as a blob in the repository and then adding a tag that points directly to that content.
cs: Správce projektu Git vyřešil tento problém tak, že přidal svůj veřejný klíč jako blob do repozitáře a poté vložil značku, která ukazuje přímo na tento obsah.

source: The maintainer pushes merged changes to the main repository.
cs: Správce odešle začleněné změny do hlavního repozitáře.

source: The major difference between Git and any other VCS (Subversion and friends included) is the way Git thinks about its data.
cs: Hlavním rozdílem mezi systémem Git a všemi ostatními systémy pro správu verzí (včetně Subversion a spol) je způsob, jakým Git o datech uvažuje.

source: The mechanism that Git uses for this checksumming is called a SHA-1 hash.(((SHA-1))) This is a 40-character string composed of hexadecimal characters (0–9 and a–f) and calculated based on the contents of a file or directory structure in Git.
cs: Pro vytváření kontrolních součtů používá Git mechanismus zvaný SHA-1.(((SHA-1))) Jde se o řetězec o 40 hexadecimálních znacích (0–9, a–f) vypočítaný na základě obsahu souboru nebo adresářové struktury systému Git.

source: The merge goes smoothly – John's commit history now looks like this:
cs: Sloučení probíhá hladce -- Johnova historie revizí teď vypadá takto:

source: The most basic and powerful tool to do this is the `git log` command.
cs: Nejzákladnějším a nejmocnějším nástrojem je v tomto případě příkaz `git log`.

source: The most common range specification is the double-dot syntax.
cs: Nejčastěji se při označení intervalu používá dvojtečková syntaxe.

source: The most interesting option is `format`, which allows you to specify your own log output format.
cs: Nejzajímavější možností je předpis `format`, který vám umožní předepsat vlastní formát výstupu logu.

source: The most obvious is the single point of failure that the centralized server represents.
cs: Tím nejkřiklavějším je kolaps po výpadku jediného místa, kterým je centrální server.

source: The next hook to run when applying patches via `git am` is `pre-applypatch`.
cs: Další zásuvným modulem, který se může spouštět při aplikaci záplaty příkazem `git am`, je `pre-applypatch`.

source: The next issue is your commit access.
cs: Další otázkou je vaše oprávnění k zapisování revizí.

source: The next line is 0000, meaning the server is done with its references listing.
cs: Následující řádek je 0000 – touto kombinací server označuje konec seznamu referencí.

source: The next section deals with projects that prefer to accept contributed patches via email.
cs: Další část pojednává o projektech, které upřednostňují přijímání záplat posílaných e-mailem.

source: The next sections will explain some typical setups using those protocols and how to get your server running with them.
cs: V dalších částech vysvětlíme některé typické konfigurace, které těchto protokolů využívají, a jak s nimi uvést server do provozu.

source: The next time one of your collaborators fetches from the server, they will get a reference to where the server's version of `serverfix` is under the remote branch `origin/serverfix`:
cs: Až bude příště některý z vašich spolupracovníků vyzvedávat data ze serveru, obdrží referenci na místo, kde se nachází serverová verze větve `serverfix` pod jménem vzdálené větve `origin/serverfix`:

source: The next time you commit, the file will be gone and no longer tracked.
cs: Při příštím zápisu (commit) už tam soubor neuvidíte a nebude se sledovat.

source: The next two sections demonstrate how to wrangle your staging area and working directory changes.
cs: Následující dvě části popisují, jak se poprat s oblastí připravených změn a se změnami v pracovním adresáři.

source: The next variable is the workflow in use for the project.
cs: Další proměnnou je pracovní postup, který se u projektu využívá.

source: The nice part is that the command you use to determine the state of those two areas also reminds you how to undo changes to them.
cs: Dobré je, že příkaz, jímž se zjišťuje stav těchto dvou oblastí, zároveň připomíná, jak v nich nežádoucí změny zrušit.

source: The nice thing about this wrapper setup is that you can change your diff and merge tools easily.
cs: Příjemné na tomto wrapperovém nastavení je, že lze snadno změnit nástroj diff i nástroj pro slučování.

source: The oneline and format options are particularly useful with another `log` option called `--graph`.
cs: Parametry `oneline` a `format` jsou zvlášť užitečné ve spojení s další volbou příkazu `log` nazvanou `--graph`.

source: The only real difference is that `mv` is one command instead of three – it's a convenience function.
cs: Jediným skutečným rozdílem je, že `mv` je jediný příkaz místo tří -- jde o funkci pro zjednodušení práce.

source: The only reason nearly every repository has one is that the `git init` command creates it by default and most people don't bother to change it.
cs: Jediným důvodem, proč ji najdete skoro v každém repozitáři, je to, že ji standardně vytváří příkaz `git init` a většina lidí se nezatěžuje tím, že by to změnili.

source: The opposing point of view is that the commit history is the *story of how your project was made.* You wouldn't publish the first draft of a book, and the manual for how to maintain your software deserves careful editing.
cs: Z opačného pohledu je historie zápisu revizí *příběhem o tom, jak váš projek vznikal*. U knihy byste také nepublikovali pracovní verzi a příručka o tom, jak udržovat udržovat váš vlastní software vyžaduje pečlivé úpravy.

source: The other advantage of this approach is that you get the history of the commits as well.
cs: Další výhodou tohoto postupu je, že získáte rovněž historii revizí.

source: The other files are your new packfile and an index.
cs: Ostatní soubory jsou v novém balíčkovém souboru a indexu.

source: The other important difference is the way you get a listing of the files that have been changed.
cs: Druhým důležitým rozdílem je způsob, jak se zobrazí seznam změněných souborů.

source: The other large change in the time since the last publishing has been the development and rise of the HTTP protocol for Git network transactions.
cs: Další velkou změnu od prvního vydání knihy byl vývoj a vzestup HTTP protokolu pro síťové transakce systému Git.

source: The other main ancestry specification is the `~`.
cs: Další základní možností označení původu je znak `~`.

source: The other main way to specify a commit is via its ancestry.
cs: Další základní způsob, jak specifikovat konkrétní revizi, je na základě jejího původu.

source: The other thing `gc` will do is pack up your references into a single file.
cs: Další operací, kterou `gc` provede, je zabalení referencí do jediného souboru.

source: The output can be sent to the maintainer – it tells them where the work was branched from, summarizes the commits, and tells where to pull this work from.
cs: Výstup příkazu lze odeslat správci. Říká mu, odkud daná větev vychází, podá mu přehled o revizích a řekne mu, odkud lze práci stáhnout.

source: The output from the command is a 40-character checksum hash.
cs: Výstupem příkazu je 40znakový otisk kontrolního součtu (checksum hash).

source: The output looks like this:
cs: Jeho výstup vypadá takto:
